const { createNote, readNote, updateNote, deleteNote } = require('./notes');

test('Създаване на забележка', () => {
  expect(createNote('Заглавие', 'Съдържание')).toBe('Забележката е създадена успешно');
});

test('Четене на забележка', () => {
  expect(readNote('Заглавие')).toBe('Съдържание на забележката');
});

test('Редактиране на забележка', () => {
  expect(updateNote('Заглавие', 'Ново съдържание')).toBe('Забележката е успешно редактирана');
});

test('Изтриване на забележка', () => {
  expect(deleteNote('Заглавие')).toBe('Забележката е успешно изтрита');
});
